# ðŸ¥· **Assignment 1-3: Reading Haskell Documentation**

Visit [hoogle.haskell.org](https://hoogle.haskell.org). We recommend bookmarking this page somewhere easy to access, like your browser toolbar, as you'll need to reference it often.

Use Hoogle to look up the following list functions and practice using them in a GHCi REPL session.

>Load GHCi with the Sandbox by running `./sbox` in your terminal from the `haskell-dojo` root directory.

* `(:)` & `(++)`:
  >Called "cons" and "append", respectively
  >These functions are "infix" operators: they're usually inserted between their arguments like other operators we've seen (`+`, `-`, `&&`, `||`):
  ```shell
  $ ./sbox

  Sandbox> 1 : [2, 3]
  [1, 2, 3]
  Sandbox> 1 : []
  [1]
  Sandbox> "I choose you, " ++ "Pikachu!"
  "I choose you, Pikachu!"
  ```
  >Like all operators, they can also be used in prefix notation by enclosing them in parentheses:
  ```shell
  Sandbox> (++) "I choose you, " "Pikachu!"
  "I choose you, Pikachu!"
  ```
  >Pay careful attention to the signatures of these functions:
  ```shell
  Sandbox> :t (:)
  (:)  ::  a  -> [a] -> [a]
  Sandbox> :t (++)
  (++) :: [a] -> [a] -> [a]
  ```
  >"cons" takes a value of any type `a` and a list of other `a` values, and prepends the value to the list.
  >"append" takes two lists containing values of any type `a` and appends the second list to the first.
  >New Haskellers frequently confuse the use of these functions and encounter type errors. How can we add a single element to the end of a list? Note that we can convert any regular value into a list (called a "singleton") by enclosing it in square brackets.
* `concat`
  >Notice `concat`'s signature:
  ```shell
  Sandbox> :t concat
  concat :: Foldable t => t [a] -> [a]
  ```
  >What this means is that `concat` can take any collection `t` containing lists of `a` values, and concatenate the contents into a list of `a` values - provided the collection is an instance of the `Foldable` class.
  >For our purposes, the only `Foldable` collection we'll be using with `concat` is a list of lists, so we can understand the signature more clearly as this:
  ```haskell
  concat :: [[a]] -> [a]
  ```
  >In other words, `concat` takes a nested list (a list of lists of `a` values) and flattens it into a single list of `a` values.
* `null`
* `head`, `tail`, `last`, `init`
  >**Note:** these functions throw runtime exceptions when called on empty lists, so they must be used cautiously.
* `elem` & `notElem`
  >As with `concat`, these functions work on various `Foldable` collections - not just lists - but we'll be using them with lists exclusively. Consider the simplified signatures below:
  ```haskell
  elem    :: Eq a => a -> [a] -> Bool
  notElem :: Eq a => a -> [a] -> Bool
  ```
  >The `Eq a` constraint says that whichever type `a` ends up being, its values must be comparable for equality.
  >In practice, `elem` and `notElem` are typically used with **infix** notation for readability, like the various binary operators we've encountered (`+`, `-`, `&&`, `||`). We can make any binary function infix by enclosing it in backticks and inserting it between its two arguments:
  
  ```shell
  Sandbox> 'x' `elem` "Snorlax"
  True
  Sandbox> 'z' `notElem` "Snorlax"
  True
  ```
* `replicate`
  >This function is surprisingly useful. We'll use it to construct an empty board in our game.
* `splitAt`
  >Try using this function with negative and out-of-range index values. What happens?
* `repeat`
  >Using `repeat` on its own in GHCi will print an infinite list that doesn't terminate. Use `CTRL + C` to interrupt the execution.
* `zip`
  >Try using `zip` with an infinite list constructed with `repeat` and a second, finite list:
    ```shell
    Sandbox> zip (repeat 0) [1, 2, 3]
    ```
  >Which unique feature of Haskell makes this result possible? What would happen if we tried something similar in other languages?
* `intercalate`
  >This function isn't part of Haskell's Prelude, so you'll need to import the `Data.List` module in your REPL session as follows:
    ```shell
    Sandbox> import Data.List
    Sandbox Data.List>
    ```
  >You can now run this command to verify that the function is available:
    ```shell
    Sandbox Data.List> :t intercalate
    intercalate :: [a] -> [[a]] -> [a]
    ```

There are many other helpful list functions available in Haskell's Prelude and the `Data.List` module. We'll use only some of them in this course, but we encourage you to explore the documentation for [Data.List](https://hackage.haskell.org/package/base-4.17.0.0/docs/Data-List.html) on Hoogle and familiarize yourself with its functions for future reference.